gateway/src/test/artillery/functional-test.yml
config:
  target: "http://localhost:28082"
  plugins:
    expect:
      outputFormat: prettyError
  phases:
    - duration: 1
      arrivalCount: 20
      # This should equal the number of scenarios
      # arrivalRate: 4
#      maxVusers: 2
  http:
    timeout: 10
  environments:
    localhost-direct-small-load:
      target: "http://localhost:28082"
      phases:
        - duration: 10
          arrivalRate: 20
    api-small-load:
      target: "https://api.trajano.net"
      phases:
        - duration: 10
          arrivalRate: 20
    localhost-direct-medium-load:
      target: "http://localhost:28082"
      phases:
        - duration: 60
          arrivalRate: 60
    localhost-direct-heavy-load:
      target: "http://localhost:28082"
      phases:
        - name: warmup
          duration: 10
          arrivalRate: 1
        - pause: 10
        - name: load
          duration: 30
          arrivalRate: 65
          maxVusers: 750
        - pause: 10
        - name: next-load
          duration: 40
          arrivalRate: 65
          maxVusers: 750
    localhost-traefik-ludicrous-load:
      target: "http://localhost:28080"
      phases:
        - name: warmup
          duration: 10
          arrivalRate: 1
        - name: load
          duration: 120
          arrivalRate: 65
          # From a single machine generating 4000 connections can cause EADDRINUSE in Windows https://github.com/artilleryio/artillery/issues/1038
          # that's both sides, so that sets a theoretical limit of 2000 connections assuming that is the only thing the machine is doing.
          # For traefik load there's client <-> traefik + traefik <-> gateway + gateway <-> service.  That's 6 connections per virtual user request
          # Let's assume there's 1000 connections used already by Windows and other services.  That leaves us 3000 connections
          # 3000 / 6 = 500
          maxVusers: 500
    localhost-direct-ludicrous-load:
      target: "http://localhost:28082"
      phases:
        - name: warmup
          duration: 10
          arrivalRate: 1
        - name: load
          duration: 100
          arrivalRate: 100
          # From a single machine generating 4000 connections can cause EADDRINUSE in Windows https://github.com/artilleryio/artillery/issues/1038
          # that's both sides, so that sets a theoretical limit of 2000 connections assuming that is the only thing the machine is doing.
          # For direct load there's client <-> gateway + gateway <-> service.  That's 4 connections per virtual user request
          # Let's assume there's 1000 connections used already by Windows and other services.  That leaves us 3000 connections
          # 3000 / 4 = 750
          # However, there's still the notion of 120 second default for TcpTimedWaitDelay which means unless the thread is disconnected for 120 seconds
          # it will be part of the limit
          maxVusers: 750
    api-heavy-load:
      target: "https://api.trajano.net"
      phases:
        - name: warmup
          duration: 10
          arrivalRate: 1
        - pause: 10
        - name: load
          duration: 30
          arrivalRate: 65
          maxVusers: 750
        - pause: 10
        - name: next-load
          duration: 40
          arrivalRate: 65
          maxVusers: 750
    api-ludicrous-load:
      target: "https://m0.lj-ppe.devhaus.net"
      phases:
        - name: warmup
          duration: 10
          arrivalRate: 1
        - name: load
          duration: 100
          arrivalRate: 100
          # From a single machine generating 4000 connections can cause EADDRINUSE in Windows https://github.com/artilleryio/artillery/issues/1038
          # that's both sides, so that sets a theoretical limit of 2000 connections assuming that is the only thing the machine is doing.
          # For direct load there's client <-> gateway + gateway <-> service.  That's 4 connections per virtual user request
          # Let's assume there's 1000 connections used already by Windows and other services.  That leaves us 3000 connections
          # 3000 / 4 = 750
          # However, there's still the notion of 120 second default for TcpTimedWaitDelay which means unless the thread is disconnected for 120 seconds
          # it will be part of the limit
          maxVusers: 750
#after:
#  flow:
#    # This will allow the last connection to terminate and clean up from the TcpTimedWaitDelay
#    - think: 60
scenarios:
  - name: Login request resource and logout
    weight: 4
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - think: 5
      - post:
          url: "/logout"
          form:
            token: "{{ refresh_token }}"
            token_type_hint: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200
  - name: Login request resource and logout with refresh
    weight: 6
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - think: 5
      - post:
          url: "/refresh"
          form:
            refresh_token: "{{ refresh_token }}"
            grant_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - think: 5
      - post:
          url: "/logout"
          form:
            token: "{{ refresh_token }}"
            token_type_hint: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200
  - name: Login request resource and logout with required refresh
    weight: 2
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer bad{{ access_token }}"
          expect:
            - statusCode: 401
      - post:
          url: "/refresh"
          form:
            refresh_token: "{{ refresh_token }}"
            grant_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 200
      - post:
          url: "/logout"
          form:
            token: "{{ refresh_token }}"
            token_type_hint: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200
  - name: Failed login
    weight: 2
    flow:
      - post:
          url: "/auth"
          json:
            username: bad
            authenticated: false
          headers:
            Accept: application/json
            Content-Type: application/json
          expect:
            - statusCode: 401
  - name: No login unauthorized
    weight: 2
    flow:
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
          expect:
            - statusCode: 401
  - name: No login unauthorized invalid bearer token
    weight: 2
    flow:
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer badtoken"
          expect:
            - statusCode: 401
  - name: Login logout and then fail request
    weight: 2
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - post:
          url: "/logout"
          form:
            token: "{{ refresh_token }}"
            token_type_hint: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 401
  - name: Login logout and then fail refresh
    weight: 2
    flow:
      - post:
          url: "/auth"
          json:
            username: good
            authenticated: true
          headers:
            Accept: application/json
            Content-Type: application/json
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - post:
          url: "/refresh"
          form:
            refresh_token: "{{ refresh_token }}"
            grant_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          capture:
            - json: "$.access_token"
              as: "access_token"
            - json: "$.refresh_token"
              as: "refresh_token"
          expect:
            - statusCode: 200
      - post:
          url: "/logout"
          form:
            token: "{{ refresh_token }}"
            token_type_hint: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 200
      - get:
          url: "/whoami"
          headers:
            Accept: application/json
            Authorization: "Bearer {{ access_token }}"
          expect:
            - statusCode: 401
      - post:
          url: "/refresh"
          form:
            refresh_token: "{{ refresh_token }}"
            grant_type: refresh_token
          headers:
            Content-Type: application/x-www-form-urlencoded
          expect:
            - statusCode: 401
            - headerEquals:
              - www-authenticate
              - Bearer realm="JWT", error="invalid_token"
  - name: OpenAPI available
    weight: 1
    flow:
      - head:
          url: "/openapi.json"
          headers:
            Accept: application/json
          expect:
            - statusCode: 200
      - get:
          url: "/openapi.json"
          headers:
            Accept: application/json
          expect:
            - statusCode: 200